### Challange

- In this lab, the objective is to identify the customers who were active in both May and June, and how did their activity differ between months. To achieve this, follow these steps:

### 1. Establish a connection between Python and the Sakila database.

In [1]:
import pandas as pd
import numpy as np

import pymysql                        # for getting data from a SQL database
from sqlalchemy import create_engine  # for establishing the connection and authentication

from getpass import getpass

In [ ]:
def my_engine():
    print("Insert your SQL Workbench password:")
    password = getpass()
    connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
    engine = create_engine(connection_string)
    return engine

In [ ]:
engine = my_engine()

### 2. Write a Python function called rentals_month that retrieves rental data for a given month and year (passed as parameters) from the Sakila database as a Pandas DataFrame. The function should take in three parameters:

- engine: an object representing the database connection engine to be used to establish a connection to the Sakila database.
- month: an integer representing the month for which rental data is to be retrieved.
- year: an integer representing the year for which rental data is to be retrieved.

- The function should execute a SQL query to retrieve the rental data for the specified month and year from the rental table in the Sakila database, and return it as a pandas DataFrame.

In [32]:
def cut_string(input):
    output = (str(input))[:7]
    return output

def create_date_filter(year: int,month: int):
    month = str(month)
    if len(month) == 1:
        month = "0" + str(month)
    else:
        month = month
    year = str(year)
    date_filter = year + "-" + month
    return date_filter

def rentals_month(engine,month: int, year: int):
    query = "SELECT rental_id AS 'Rental_ID', rental_date AS 'Rental_Date', customer_id AS 'Customer_ID' \
FROM sakila.rental"
    data = pd.read_sql_query(query, engine)
    data.tail()
    data["Rental_Date"] = data["Rental_Date"].astype(str)  # Source: https://www.geeksforgeeks.org/convert-the-column-type-from-string-to-datetime-format-in-pandas-dataframe/
    data["Rental_Date"] = data["Rental_Date"].apply(cut_string)
    filter = create_date_filter(year,month)
    data = data[data['Rental_Date'] == filter]
    return data

In [23]:
rentals_month(engine,5,2005)

      Rental_ID Rental_Date  Customer ID
0             1     2005-05          130
1             2     2005-05          459
2             3     2005-05          408
3             4     2005-05          333
4             5     2005-05          222
...         ...         ...          ...
1151       1153     2005-05          506
1152       1154     2005-05           59
1153       1155     2005-05          251
1154       1156     2005-05          106
1155       1157     2005-05           61

[1156 rows x 3 columns]

### 3. Develop a Python function called rental_count_month that takes the DataFrame provided by rentals_month as input along with the month and year and returns a new DataFrame containing the number of rentals made by each customer_id during the selected month and year.

- The function should also include the month and year as parameters and use them to name the new column according to the month and year, for example, if the input month is 05 and the year is 2005, the column name should be "rentals_05_2005".

- Hint: Consider making use of pandas groupby()

In [66]:
df1 = rentals_month(engine,5,2005)
df2 = rentals_month(engine,6,2005)

In [80]:
def rental_count_month(df,month,year):
    month = str(month)
    year = str(year)
    column_name = "rentals_" + month + "_" + year
    # Source: https://www.statology.org/pandas-groupby-to-dataframe/
    grouped_data = df.groupby(["Customer_ID"]) # Here as output not a dataframe, but a grouped object, grouped by a column Customer_ID
    grouped_data = grouped_data.size() # Getting size of groups
    df = grouped_data.reset_index(name=column_name) #Creating a column with results of size of grouped data
    return df

In [83]:
df1_count = rental_count_month(df1,"05","2005")

In [84]:
df2_count = rental_count_month(df2,"06","2005")

### 4. Create a Python function called compare_rentals 
- that takes two DataFrames as input containing the number of rentals made by each customer in different months and years. The function should return a combined DataFrame with a new 'difference' column, which is the difference between the number of rentals in the two months.

In [103]:
def compare_rentals(df1,df2):
    df_compare = pd.merge(df1, df2,
                          on="Customer_ID")
    df_compare["Difference"] = df_compare["rentals_05_2005"] - df_compare["rentals_06_2005"]
    return df_compare

In [104]:
compare_rentals(df1_count,df2_count)

     Customer_ID  rentals_05_2005  rentals_06_2005  Difference
0              1                2                7          -5
1              2                1                1           0
2              3                2                4          -2
3              5                3                5          -2
4              6                3                4          -1
..           ...              ...              ...         ...
507          594                4                6          -2
508          595                1                2          -1
509          596                6                2           4
510          597                2                3          -1
511          599                1                4          -3

[512 rows x 4 columns]